cmsis-svd/cmsis-svd/data/Nuvoton/M051_Series.xml
       <register>
          <name>P0_MFP</name>
          <description>P0 multiple function and input type control register</description>
          <addressOffset>0x00000030</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>P0_MFP</name>
              <description>P0 multiple function Selection
The pin function of P0 is depending on P0_MFP and P0_ALT.
Refer to P0_ALT descriptions in detail.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>P0_ALT0</name>
              <description>P0.0 alternate function Selection
The pin function of P0.0 is depend on P0_MFP[0] and P0_ALT[0].
P0_ALT[0]	P0_MFP[0]	P0.0function	
0	0	P0.0	
0	1	AD0(EBI)	
1	0	CTS1(UART1)	
1	1	Reserved	</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>P0_ALT1</name>
              <description>P0.1 alternate function Selection
The pin function of P0.1 is depend on P0_MFP[1] and P0_ALT[1].
P0_ALT[1]	P0_MFP[1]	P0.1function	
0	0	P0.1	
0	1	AD1(EBI)	
1	0	RTS1(UART1)	
1	1	Reserved	</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>P0_ALT2</name>
              <description>P0.2 alternate function Selection
The pin function of P0.2 is depend on P0_MFP[2] and P0_ALT[2].
P0_ALT[2]	P0_MFP[2]	P0.2function	
0	0	P0.2	
0	1	AD2(EBI)	
1	0	CTS0(UART0)	
1	1	Reserved	</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>P0_ALT3</name>
              <description>P0.3 alternate function Selection
The pin function of P0.3 is depend on P0_MFP[3] and P0_ALT[3].
P0_ALT[3]	P0_MFP[3]	P0.3function	
0	0	P0.3	
0	1	AD3(EBI)	
1	0	RTS0(UART0)	
1	1	Reserved	</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>P0_ALT4</name>
              <description>P0.4 alternate function Selection
The pin function of P0.4 is depend on P0_MFP[4] and P0_ALT[4].
P0_ALT[4]	P0_MFP[4]	P0.4function	
0	0	P0.4	
0	1	AD4(EBI)	
1	0	SPISS1(SPI1)	
1	1	Reserved	</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>P0_ALT5</name>
              <description>P0.5 alternate function Selection
The pin function of P0.5 is depend on P0_MFP[5] and P0_ALT[5].
P0_ALT[5]	P0_MFP[5]	P0.5 function	
0	0	P0.5	
0	1	AD5(EBI)	
1	0	MOSI_1(SPI1)	
1	1	Reserved	</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>P0_ALT6</name>
              <description>P0.6 alternate function Selection
The pin function of P0.6 is depend on P0_MFP[6] and P0_ALT[6].
P0_ALT[6]	P0_MFP[6]	P0.6 function	
0	0	P0.6	
0	1	AD6(EBI)	
1	0	MISO_1(SPI1)	
1	1	Reserved	</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>P0_ALT7</name>
              <description>P0.7 alternate function Selection
The pin function of P0.7 is depend on P0_MFP[7] and P0_ALT[7].
P0_ALT[7]	P0_MFP[7]	P0.7 function	
0	0	P0.7	
0	1	AD7(EBI)	
1	0	SPICLK1(SPI1)	
1	1	Reserved	</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>P0_TYPEn</name>
              <description>P0[7:0] input Schmitt Trigger function Enable
1= P0[7:0] I/O input Schmitt Trigger function enable
0= P0[7:0] I/O input Schmitt Trigger function disable </description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
          </fields>
       </register>
       <register>
          <name>P1_MFP</name>
          <description>P1 multiple function and input type control register</description>
          <addressOffset>0x00000034</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>P1_MFP</name>
              <description>P1 multiple function Selection
The pin function of P1 is depending on P1_MFP and P1_ALT.
Refer to P1_ALT descriptions in detail.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>P1_ALT0</name>
              <description>P1.0 alternate function Selection
The pin function of P1.0 is depend on P1_MFP[0] and P1_ALT[0].
P1_ALT[0]	P1_MFP[0]	P1.0function	
0	0	P1.0	
0	1	AIN0(ADC)	
1	0	T2(Timer2)	
1	1	Reserved	</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>P1_ALT1</name>
              <description>P1.1 alternate function Selection
The pin function of P1.1 is depend on P1_MFP[1] and P1_ALT[1].
P1_ALT[1]	P1_MFP[1]	P1.1function	
0	0	P1.1	
0	1	AIN1(ADC)	
1	0	T3(Timer3)	
1	1	Reserved	</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>P1_ALT2</name>
              <description>P1.2 alternate function Selection
The pin function of P1.2 is depend on P1_MFP[2] and P1_ALT[2].
P1_ALT[2]	P1_MFP[2]	P1.2function	
0	0	P1.2	
0	1	AIN2(ADC)	
1	0	RXD1(UART1)	
1	1	Reserved	</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>P1_ALT3</name>
              <description>P1.3 alternate function Selection
The pin function of P1.3 is depend on P1_MFP[3] and P1_ALT[3].
P1_ALT[3]	P1_MFP[3]	P1.3function	
0	0	P1.3	
0	1	AIN3(ADC)	
1	0	TXD1(UART1)	
1	1	Reserved	</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>P1_ALT4</name>
              <description>P1.4 alternate function Selection
The pin function of P1.4 is depend on P1_MFP[4] and P1_ALT[4].
P1_ALT[4]	P1_MFP[4]	P1.4function	
0	0	P1.4	
0	1	AIN4(ADC)	
1	0	SPISS0(SPI0)	
1	1	Reserved	</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>P1_ALT5</name>
              <description>P1.5 alternate function Selection
The pin function of P1.5 is depend on P1_MFP[5] and P1_ALT[5].
P1_ALT[5]	P1_MFP[5]	P1.5 function	
0	0	P1.5	
0	1	AIN5(ADC)	
1	0	MOSI_0(SPI0)	
1	1	Reserved	</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>P1_ALT6</name>
              <description>P1.6 alternate function Selection
The pin function of P1.6 is depend on P1_MFP[6] and P1_ALT[6].
P1_ALT[6]	P1_MFP[6]	P1.6 function	
0	0	P1.6	
0	1	AIN6(ADC)	
1	0	MISO_0(SPI0)	
1	1	Reserved	</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>P1_ALT7</name>
              <description>P1.7 alternate function Selection
The pin function of P1.7 is depend on P1_MFP[7] and P1_ALT[7].
P1_ALT[7]	P1_MFP[7]	P1.7 function	
0	0	P1.7	
0	1	AIN7(ADC)	
1	0	SPICLK0(SPI0)	
1	1	Reserved	</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>P1_TYPEn</name>
              <description>P1[7:0] input Schmitt Trigger function Enable
1= P1[7:0] I/O input Schmitt Trigger function enable
0= P1[7:0] I/O input Schmitt Trigger function disable </description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
          </fields>
       </register>
       <register>
          <name>P2_MFP</name>
          <description>P2 multiple function and input type control register</description>
          <addressOffset>0x00000038</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>P2_MFP</name>
              <description>P2 multiple function Selection
The pin function of P2 is depending on P2_MFP and P2_ALT.
Refer to P2_ALT descriptions in detail.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>P2_ALT0</name>
              <description>P2.0 alternate function Selection
The pin function of P2.0 is depend on P2_MFP[0] and P2_ALT[0].
P2_ALT[0]	P2_MFP[0]	P2.0function	
0	0	P2.0	
0	1	AD8(EBI)	
1	0	PWM0(PWM generator 0)	
1	1	Reserved	</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>P2_ALT1</name>
              <description>P2.1 alternate function Selection
The pin function of P2.1 is depend on P2_MFP[1] and P2_ALT[1].
P2_ALT[1]	P2_MFP[1]	P2.1function	
0	0	P2.1	
0	1	AD9(EBI)	
1	0	PWM1(PWM generator 0)	
1	1	Reserved	</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>P2_ALT2</name>
              <description>P2.2 alternate function Selection
The pin function of P2.2 is depend on P2_MFP[2] and P2_ALT[2].
P2_ALT[2]	P2_MFP[2]	P2.2function	
0	0	P2.2	
0	1	AD10(EBI)	
1	0	PWM2(PWM generator 2)	
1	1	Reserved	</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>P2_ALT3</name>
              <description>P2.3 alternate function Selection
The pin function of P2.3 is depend on P2_MFP[3] and P2_ALT[3].
P2_ALT[3]	P2_MFP[3]	P2.3function	
0	0	P2.3	
0	1	AD11(EBI)	
1	0	PWM3(PWM generator 2)	
1	1	Reserved	</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>P2_ALT4</name>
              <description>P2.4 alternate function Selection
The pin function of P2.4 is depend on P2_MFP[4] and P2_ALT[4].
P2_ALT[4]	P2_MFP[4]	P0.4function	
0	0	P0.4	
0	1	AD12(EBI)	
1	0	PWM4(PWM generator 4)	
1	1	Reserved	</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>P2_ALT5</name>
              <description>P2.5 alternate function Selection
The pin function of P2.5 is depend on P2_MFP[5] and P2_ALT[5].
P2_ALT[5]	P2_MFP[5]	P2.5 function	
0	0	P2.5	
0	1	AD13(EBI)	
1	0	PWM5(PWM generator 4)	
1	1	Reserved	</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>P2_ALT6</name>
              <description>P2.6 alternate function Selection
The pin function of P2.6 is depend on P2_MFP[6] and P2_ALT[6].
P2_ALT[6]	P2_MFP[6]	P2.6 function	
0	0	P2.6	
0	1	AD14(EBI)	
1	0	PWM6(PWM generator 6)	
1	1	Reserved	</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>P2_ALT7</name>
              <description>P2.7 alternate function Selection
The pin function of P2.7 is depend on P2_MFP[7] and P2_ALT[7].
P2_ALT[7]	P2_MFP[7]	P2.7 function	
0	0	P2.7	
0	1	AD15(EBI)	
1	0	PWM7(PWM generator 6)	
1	1	Reserved	</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>P2_TYPEn</name>
              <description>P2[7:0] input Schmitt Trigger function Enable
1= P2[7:0] I/O input Schmitt Trigger function enable
0= P2[7:0] I/O input Schmitt Trigger function disable </description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
          </fields>
       </register>
