cmsis-svd/cmsis-svd/data/Nuvoton/M051_Series.xml
       <register>
          <name>P3_MFP</name>
          <description>P3 multiple function and input type control register</description>
          <addressOffset>0x0000003c</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>P3_MFP</name>
              <description>P3 multiple function Selection
The pin function of P3 is depending on P3_MFP and P3_ALT.
Refer to P3_ALT descriptions in detail.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>P3_ALT0</name>
              <description>P3.0 alternate function Selection
The pin function of P3.0 is depend on P3_MFP[0] and P3_ALT[0].
P3_ALT[0]	P3_MFP[0]	P3.0function	
0	0	P3.0	
0	1	RXD(UART0)	
1	x	Reserved	</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>P3_ALT1</name>
              <description>P3.1 alternate function Selection
The pin function of P3.1 is depend on P3_MFP[1] and P3_ALT[1].
P3_ALT[1]	P3_MFP[1]	P3.1function	
0	0	P3.1	
0	1	TXD(UART0)	
1	x	Reserved	</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>P3_ALT2</name>
              <description>P3.2 alternate function Selection
The pin function of P3.2 is depend on P3_MFP[2] and P3_ALT[2].
P3_ALT[2]	P3_MFP[2]	P3.2function	
0	0	P3.2	
0	1	/INT0	
1	1	Reserved	</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>P3_ALT3</name>
              <description>P3.3 alternate function Selection
The pin function of P3.3 is depend on P3_MFP[3] and P3_ALT[3].
P3_ALT[3]	P3_MFP[3]	P3.3function	
0	0	P3.3	
0	1	/INT1	
1	0	MCLK(EBI)	
1	x	Reserved	</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>P3_ALT4</name>
              <description>P3.4 alternate function Selection
The pin function of P3.4 is depend on P3_MFP[4] and P3_ALT[4].
P3_ALT[4]	P3_MFP[4]	P3.4function	
0	0	P3.4	
0	1	T0(Timer0)	
1	0	SDA(I2C)	
1	1	Reserved	</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>P3_ALT5</name>
              <description>P3.5 alternate function Selection
The pin function of P3.5 is depend on P3_MFP[5] and P3_ALT[5].
P3_ALT[5]	P3_MFP[5]	P3.5 function	
0	0	P3.5	
0	1	T1(Timer1)	
1	0	SCL(I2C)	
1	1	Reserved	</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>P3_ALT6</name>
              <description>P3.6 alternate function Selection
The pin function of P3.6 is depend on P3_MFP[6] and P3_ALT[6].
P3_ALT[6]	P3_MFP[6]	P3.6 function	
0	0	P3.6	
0	1	WR(EBI)	
1	0	CKO(Clock Driver output)	
1	1	Reserved	</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>P3_ALT7</name>
              <description>P3.7 alternate function Selection
The pin function of P3.7 is depend on P3_MFP[7] and P3_ALT[7].
P3_ALT[7]	P3_MFP[7]	P3.7 function	
0	0	P3.7	
0	1	RD(EBI)	
1	x	Reserved	</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>P3_TYPEn</name>
              <description>P3[7:0] input Schmitt Trigger function Enable
1= P3[7:0] I/O input Schmitt Trigger function enable
0= P3[7:0] I/O input Schmitt Trigger function disable </description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
          </fields>
       </register>
       <register>
          <name>P4_MFP</name>
          <description>P4 input type control register</description>
          <addressOffset>0x00000040</addressOffset>
          <access>read-write</access>
          <resetValue>0x000000c0</resetValue>
          <resetMask>0xffffff3f</resetMask>
          <fields>
            <field>
              <name>P4_MFP</name>
              <description>P4 multiple function Selection
The pin function of P4 is depending on P4_MFP and P4_ALT.
Refer to P4_ALT descriptions in detail.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>P4_ALT0</name>
              <description>P4.0 alternate function Selection
The pin function of P4.0 is depend on P4_MFP[0] and P4_ALT[0].
P4_ALT[0]	P4_MFP[0]	P4.0function	
0	0	P4.0	
0	1	PWM0(PWM generator 0)	
1	x	Reserved	</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>P4_ALT1</name>
              <description>P4.1 alternate function Selection
The pin function of P4.1 is depend on P4_MFP[1] and P4_ALT[1].
P4_ALT[1]	P4_MFP[1]	P4.1function	
0	0	P4.1	
0	1	PWM1(PWM generator 0)	
1	x	Reserved	</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>P4_ALT2</name>
              <description>P4.2 alternate function Selection
The pin function of P4.2 is depend on P4_MFP[2] and P4_ALT[2].
P4_ALT[2]	P4_MFP[2]	P4.2function	
0	0	P4.2	
0	1	PWM2(PWM generator 2)	
1	x	Reserved	</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>P4_ALT3</name>
              <description>P4.3 alternate function Selection
The pin function of P4.3 is depend on P4_MFP[3] and P4_ALT[3].
P4_ALT[3]	P4_MFP[3]	P4.3function	
0	0	P4.3	
0	1	PWM3(PWM generator 2)	
1	x	Reserved	</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>P4_ALT4</name>
              <description>P4.4 alternate function Selection
The pin function of P4.4 is depend on P4_MFP[4] and P4_ALT[4].
P4_ALT[4]	P4_MFP[4]	P4.4function	
0	0	P4.4	
0	1	/CS(EBI)	
1	x	Reserved	</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>P4_ALT5</name>
              <description>P4.5 alternate function Selection
The pin function of P4.5 is depend on P4_MFP[5] and P4_ALT[5].
P4_ALT[5]	P4_MFP[5]	P4.5 function	
0	0	P4.5	
0	1	ALE(EBI)	
1	x	Reserved	</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>P4_ALT6</name>
              <description>P4.6 alternate function Selection
The pin function of P4.6 is depend on P4_MFP[6] and P4_ALT[6].
P4_ALT[6]	P4_MFP[6]	P4.6 function	
0	0	P4.6	
0	1	ICE_CLK(ICE)	
1	x	Reserved	</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>P4_ALT7</name>
              <description>P4.7 alternate function Selection
The pin function of P4.7 is depend on P4_MFP[7] and P4_ALT[7].
P4_ALT[7]	P4_MFP[7]	P4.7 function	
0	0	P4.7	
0	1	ICE_DAT(ICE)	
1	x	Reserved	</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>P4_TYPEn</name>
              <description>P4[7:0] input Schmitt Trigger function Enable
1= P4[7:0] I/O input Schmitt Trigger function enable
0= P4[7:0] I/O input Schmitt Trigger function disable </description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
          </fields>
       </register>
       <register>
          <name>REGWRPROT</name>
          <description>Register Lock Key address</description>
          <addressOffset>0x00000100</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>REGWRPROT</name>
              <description>Register Write-Protected Code (Write Only)
Some write-protected registers have to be disabled the protected function by writing the sequence value &quot;59h&quot;, &quot;16h&quot;, &quot;88h&quot; to this field. After this sequence is completed, the REGPROTDIS bit will be set to 1 and write-protected registers can be normal write.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>REGPROTDIS</name>
              <description>Register Write-Protected Disable index (Read only)
1 = Protection is disabled for writing protected registers
0 = Protection is enabled for writing protected registers. Any write to the protected register is ignored.
The Write-Protected registers list are below table:
Registers	Address	Note	
IPRSTC1	0x5000_0008	None	
BODCR	0x5000_0018	None	
PORCR	0x5000_001C	None	
PWRCON	0x5000_0200	bit[6] is not protected for power wake-up interrupt clear	
APBCLK bit[0]	0x5000_0208	bit[0] is watch dog clock enable	
CLKSEL0	0x5000_0210	HCLK and CPU STCLK clock source select	
CLK_SEL1 bit[1:0]	0x5000_0214	Watch dog clock source select	
ISPCON	0x5000_C000	Flash ISP Control register	
WTCR	0x4000_4000	None	
FATCON	0x5000_C018	None	</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
          </fields>
       </register>
