cmsis-svd/cmsis-svd/data/Nuvoton/M051_Series.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>GP0</name>
      <description>Registers group</description>
      <groupName>GPIO</groupName>
      <baseAddress>0x50004000</baseAddress>
      <!-- the first addressBlock is occupied by registers. The second block is reserved -> no access permission -->
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00000024</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
       <register>
          <name>PMD</name>
          <description>Bit Mode Control</description>
          <addressOffset>0x00000000</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000ffff</resetValue>
          <resetMask>0xffff0000</resetMask>
          <fields>
            <field>
              <name>PMD0</name>
              <description>P0 I/O Pin[0] Mode Control
Determine each I/O type of P0 pins
00 = P0[0] pin is in INPUT mode.
01 = P0[0] pin is in OUTPUT mode.
10 = P0[0] pin is in Open-Drain mode.
11 = P0[0] pin is in Quasi-bidirectional mode.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>PMD1</name>
              <description>P0 I/O Pin[1] Mode Control
Determine each I/O type of P0 pins
00 = P0[1] pin is in INPUT mode.
01 = P0[1] pin is in OUTPUT mode.
10 = P0[1] pin is in Open-Drain mode.
11 = P0[1] pin is in Quasi-bidirectional mode.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>PMD2</name>
              <description>P0 I/O Pin[2] Mode Control
Determine each I/O type of P0 pins
00 = P0[2] pin is in INPUT mode.
01 = P0[2] pin is in OUTPUT mode.
10 = P0[2] pin is in Open-Drain mode.
11 = P0[2] pin is in Quasi-bidirectional mode.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>PMD3</name>
              <description>P0 I/O Pin[3] Mode Control
Determine each I/O type of P0 pins
00 = P0[3] pin is in INPUT mode.
01 = P0[3] pin is in OUTPUT mode.
10 = P0[3] pin is in Open-Drain mode.
11 = P0[3] pin is in Quasi-bidirectional mode.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>PMD4</name>
              <description>P0 I/O Pin[4] Mode Control
Determine each I/O type of P0 pins
00 = P0[4] pin is in INPUT mode.
01 = P0[4] pin is in OUTPUT mode.
10 = P0[4] pin is in Open-Drain mode.
11 = P0[4] pin is in Quasi-bidirectional mode.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>PMD5</name>
              <description>P0 I/O Pin[5] Mode Control
Determine each I/O type of P0 pins
00 = P0[5] pin is in INPUT mode.
01 = P0[5] pin is in OUTPUT mode.
10 = P0[5] pin is in Open-Drain mode.
11 = P0[5] pin is in Quasi-bidirectional mode.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>PMD6</name>
              <description>P0 I/O Pin[6] Mode Control
Determine each I/O type of P0 pins
00 = P0[6] pin is in INPUT mode.
01 = P0[6] pin is in OUTPUT mode.
10 = P0[6] pin is in Open-Drain mode.
11 = P0[6] pin is in Quasi-bidirectional mode.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>PMD7</name>
              <description>P0 I/O Pin[7] Mode Control
Determine each I/O type of P0 pins
00 = P0[7] pin is in INPUT mode.
01 = P0[7] pin is in OUTPUT mode.
10 = P0[7] pin is in Open-Drain mode.
11 = P0[7] pin is in Quasi-bidirectional mode.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
          </fields>
       </register>
       <register>
          <name>OFFD</name>
          <description>Bit OFF Digital Enable</description>
          <addressOffset>0x00000004</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>OFFD</name>
              <description>OFFD: P0 Pin OFF digital input path Enable
1 = Disable IO digital input path (digital input tied to low)
0 = Enable IO digital input path</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
          </fields>
       </register>
       <register>
          <name>DOUT</name>
          <description>Data Output Value</description>
          <addressOffset>0x00000008</addressOffset>
          <access>read-write</access>
          <resetValue>0x000000ff</resetValue>
          <resetMask>0xffffff00</resetMask>
          <fields>
            <field>
              <name>DOUT0</name>
              <description>P0 Pin[0] Output Value
Each of these bits control the status of a P0 pin when the P0 pin is configures as output, open-drain and quasi-mode.
1 = P0 Pin[0] will drive High if the corresponding output mode enabling bit is set.
0 = P0 Pin[0] will drive Low if the corresponding output mode enabling bit is set.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>DOUT1</name>
              <description>P0 Pin[1] Output Value
Each of these bits control the status of a P0 pin when the P0 pin is configures as output, open-drain and quasi-mode.
1 = P0 Pin[1] will drive High if the corresponding output mode enabling bit is set.
0 = P0 Pin[1] will drive Low if the corresponding output mode enabling bit is set.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>DOUT2</name>
              <description>P0 Pin[2] Output Value
Each of these bits control the status of a P0 pin when the P0 pin is configures as output, open-drain and quasi-mode.
1 = P0 Pin[2] will drive High if the corresponding output mode enabling bit is set.
0 = P0 Pin[2] will drive Low if the corresponding output mode enabling bit is set.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>DOUT3</name>
              <description>P0 Pin[3] Output Value
Each of these bits control the status of a P0 pin when the P0 pin is configures as output, open-drain and quasi-mode.
1 = P0 Pin[3] will drive High if the corresponding output mode enabling bit is set.
0 = P0 Pin[3] will drive Low if the corresponding output mode enabling bit is set.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>DOUT4</name>
              <description>P0 Pin[4] Output Value
Each of these bits control the status of a P0 pin when the P0 pin is configures as output, open-drain and quasi-mode.
1 = P0 Pin[4] will drive High if the corresponding output mode enabling bit is set.
0 = P0 Pin[4] will drive Low if the corresponding output mode enabling bit is set.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>DOUT5</name>
              <description>P0 Pin[5] Output Value
Each of these bits control the status of a P0 pin when the P0 pin is configures as output, open-drain and quasi-mode.
1 = P0 Pin[5] will drive High if the corresponding output mode enabling bit is set.
0 = P0 Pin[5] will drive Low if the corresponding output mode enabling bit is set.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>DOUT6</name>
              <description>P0 Pin[6] Output Value
Each of these bits control the status of a P0 pin when the P0 pin is configures as output, open-drain and quasi-mode.
1 = P0 Pin[6] will drive High if the corresponding output mode enabling bit is set.
0 = P0 Pin[6] will drive Low if the corresponding output mode enabling bit is set.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>DOUT7</name>
              <description>P0 Pin[7] Output Value
Each of these bits control the status of a P0 pin when the P0 pin is configures as output, open-drain and quasi-mode.
1 = P0 Pin[7] will drive High if the corresponding output mode enabling bit is set.
0 = P0 Pin[7] will drive Low if the corresponding output mode enabling bit is set.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
          </fields>
       </register>
       <register>
          <name>DMASK</name>
          <description>Data Output Write Mask</description>
          <addressOffset>0x0000000c</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>DMASK0</name>
              <description>P0 Data Output Write Mask
These bits are used to protect the corresponding register of P0_DOUT bit[0]. When set the DMASK bit[0] to &quot;1&quot;, the corresponding DOUT0 bit is protected. The write signal is masked, write data to the protect bit is ignored
0 = The corresponding P0_DOUT[0] bit can be updated
1 = The corresponding P0_DOUT[0] bit is protected</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>DMASK1</name>
              <description>P0 Data Output Write Mask
These bits are used to protect the corresponding register of P0_DOUT bit[1]. When set the DMASK bit[1] to &quot;1&quot;, the corresponding DOUT1 bit is protected. The write signal is masked, write data to the protect bit is ignored
0 = The corresponding P0_DOUT[1] bit can be updated
1 = The corresponding P0_DOUT[1] bit is protected</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>DMASK2</name>
              <description>P0 Data Output Write Mask
These bits are used to protect the corresponding register of P0_DOUT bit[2]. When set the DMASK bit[2] to &quot;1&quot;, the corresponding DOUT2 bit is protected. The write signal is masked, write data to the protect bit is ignored
0 = The corresponding P0_DOUT[2] bit can be updated
1 = The corresponding P0_DOUT[2] bit is protected</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>DMASK3</name>
              <description>P0 Data Output Write Mask
These bits are used to protect the corresponding register of P0_DOUT bit[3]. When set the DMASK bit[3] to &quot;1&quot;, the corresponding DOUT3 bit is protected. The write signal is masked, write data to the protect bit is ignored
0 = The corresponding P0_DOUT[3] bit can be updated
1 = The corresponding P0_DOUT[3] bit is protected</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>DMASK4</name>
              <description>P0 Data Output Write Mask
These bits are used to protect the corresponding register of P0_DOUT bit[4]. When set the DMASK bit[4] to &quot;1&quot;, the corresponding DOUT4 bit is protected. The write signal is masked, write data to the protect bit is ignored
0 = The corresponding P0_DOUT[4] bit can be updated
1 = The corresponding P0_DOUT[4] bit is protected</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>DMASK5</name>
              <description>P0 Data Output Write Mask
These bits are used to protect the corresponding register of P0_DOUT bit[6]. When set the DMASK bit[6] to &quot;1&quot;, the corresponding DOUT6 bit is protected. The write signal is masked, write data to the protect bit is ignored
0 = The corresponding P0_DOUT[6] bit can be updated
1 = The corresponding P0_DOUT[6] bit is protected</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>DMASK6</name>
              <description>P0 Data Output Write Mask
These bits are used to protect the corresponding register of P0_DOUT bit[6]. When set the DMASK bit[6] to &quot;1&quot;, the corresponding DOUT6 bit is protected. The write signal is masked, write data to the protect bit is ignored
0 = The corresponding P0_DOUT[6] bit can be updated
1 = The corresponding P0_DOUT[6] bit is protected</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>DMASK7</name>
              <description>P0 Data Output Write Mask
These bits are used to protect the corresponding register of P0_DOUT bit[7]. When set the DMASK bit[7] to &quot;1&quot;, the corresponding DOUT7 bit is protected. The write signal is masked, write data to the protect bit is ignored
0 = The corresponding P0_DOUT[7] bit can be updated
1 = The corresponding P0_DOUT[7] bit is protected</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
          </fields>
       </register>
