cmsis-svd/cmsis-svd/data/Nuvoton/M051_Series.xml
       <register>
          <name>IEN</name>
          <description>Interrupt Enable</description>
          <addressOffset>0x0000001c</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>IF_EN0</name>
              <description>Port0 Interrupt Enable by Input Falling Edge or Input Level Low
IF_EN[0] used to enable the interrupt for each of the corresponding input P0[0]. Set bit &quot;1&quot; also enable the pin wakeup function.
When set the IF_EN[0] bit &quot;1&quot;:
If the interrupt is level mode trigger, the input P0[0] state at level &quot;low&quot; will generate the interrupt.
If the interrupt is edge mode trigger, the input P0[0] state change from &quot;high-to-low&quot; will generate the interrupt.
1 = Enable the P0[0] state low-level or high-to-low change interrupt
0 = Disable the P0[0] state low-level or high-to-low change interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>IF_EN1</name>
              <description>Port0 Interrupt Enable by Input Falling Edge or Input Level Low
IF_EN[1] used to enable the interrupt for each of the corresponding input P0[1]. Set bit &quot;1&quot; also enable the pin wakeup function.
When set the IF_EN[1] bit &quot;1&quot;:
If the interrupt is level mode trigger, the input P0[1] state at level &quot;low&quot; will generate the interrupt.
If the interrupt is edge mode trigger, the input P0[1] state change from &quot;high-to-low&quot; will generate the interrupt.
1 = Enable the P0[1] state low-level or high-to-low change interrupt
0 = Disable the P0[1] state low-level or high-to-low change interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>IF_EN2</name>
              <description>Port0 Interrupt Enable by Input Falling Edge or Input Level Low
IF_EN[2] used to enable the interrupt for each of the corresponding input P0[2]. Set bit &quot;1&quot; also enable the pin wakeup function.
When set the IF_EN[2] bit &quot;1&quot;:
If the interrupt is level mode trigger, the input P0[2] state at level &quot;low&quot; will generate the interrupt.
If the interrupt is edge mode trigger, the input P0[2] state change from &quot;high-to-low&quot; will generate the interrupt.
1 = Enable the P0[2] state low-level or high-to-low change interrupt
0 = Disable the P0[2] state low-level or high-to-low change interrupt</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>IF_EN3</name>
              <description>Port0 Interrupt Enable by Input Falling Edge or Input Level Low
IF_EN[3] used to enable the interrupt for each of the corresponding input P0[3]. Set bit &quot;1&quot; also enable the pin wakeup function.
When set the IF_EN[3] bit &quot;1&quot;:
If the interrupt is level mode trigger, the input P0[3] state at level &quot;low&quot; will generate the interrupt.
If the interrupt is edge mode trigger, the input P0[3] state change from &quot;high-to-low&quot; will generate the interrupt.
1 = Enable the P0[3] state low-level or high-to-low change interrupt
0 = Disable the P0[3] state low-level or high-to-low change interrupt</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>IF_EN4</name>
              <description>Port0 Interrupt Enable by Input Falling Edge or Input Level Low
IF_EN[4] used to enable the interrupt for each of the corresponding input P0[4]. Set bit &quot;1&quot; also enable the pin wakeup function.
When set the IF_EN[4] bit &quot;1&quot;:
If the interrupt is level mode trigger, the input P0[4] state at level &quot;low&quot; will generate the interrupt.
If the interrupt is edge mode trigger, the input P0[4] state change from &quot;high-to-low&quot; will generate the interrupt.
1 = Enable the P0[4] state low-level or high-to-low change interrupt
0 = Disable the P0[4] state low-level or high-to-low change interrupt</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>IF_EN5</name>
              <description>Port0 Interrupt Enable by Input Falling Edge or Input Level Low
IF_EN[5] used to enable the interrupt for each of the corresponding input P0[5]. Set bit &quot;1&quot; also enable the pin wakeup function.
When set the IF_EN[5] bit &quot;1&quot;:
If the interrupt is level mode trigger, the input P0[5] state at level &quot;low&quot; will generate the interrupt.
If the interrupt is edge mode trigger, the input P0[5] state change from &quot;high-to-low&quot; will generate the interrupt.
1 = Enable the P0[5] state low-level or high-to-low change interrupt
0 = Disable the P0[5] state low-level or high-to-low change interrupt</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>IF_EN6</name>
              <description>Port0 Interrupt Enable by Input Falling Edge or Input Level Low
IF_EN[6] used to enable the interrupt for each of the corresponding input P0[6]. Set bit &quot;1&quot; also enable the pin wakeup function.
When set the IF_EN[6] bit &quot;1&quot;:
If the interrupt is level mode trigger, the input P0[6] state at level &quot;low&quot; will generate the interrupt.
If the interrupt is edge mode trigger, the input P0[6] state change from &quot;high-to-low&quot; will generate the interrupt.
1 = Enable the P0[6] state low-level or high-to-low change interrupt
0 = Disable the P0[6] state low-level or high-to-low change interrupt</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>IF_EN7</name>
              <description>Port0 Interrupt Enable by Input Falling Edge or Input Level Low
IF_EN[7] used to enable the interrupt for each of the corresponding input P0[7]. Set bit &quot;1&quot; also enable the pin wakeup function.
When set the IF_EN[7] bit &quot;1&quot;:
If the interrupt is level mode trigger, the input P0[7] state at level &quot;low&quot; will generate the interrupt.
If the interrupt is edge mode trigger, the input P0[7] state change from &quot;high-to-low&quot; will generate the interrupt.
1 = Enable the P0[7] state low-level or high-to-low change interrupt
0 = Disable the P0[7] state low-level or high-to-low change interrupt</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>IR_EN0</name>
              <description>Port 0 Interrupt Enable by Input Rising Edge or Input Level High
IR_EN[0] used to enable the interrupt for each of the corresponding input P0[0]. Set bit &quot;1&quot; also enable the pin wakeup function.
When set the IR_EN[0] bit &quot;1&quot;:
If the interrupt is level mode trigger, the input P0[0] state at level &quot;high&quot; will generate the interrupt.
If the interrupt is edge mode trigger, the input P0[0] state change from &quot;low-to-high&quot; will generate the interrupt.
1 = Enable the P0[0] level-high or low-to-high interrupt
0 = Disable the P0[0] level-high or low-to-high interrupt</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>IR_EN1</name>
              <description>Port 0 Interrupt Enable by Input Rising Edge or Input Level High
IR_EN[1] used to enable the interrupt for each of the corresponding input P0[1]. Set bit &quot;1&quot; also enable the pin wakeup function.
When set the IR_EN[1] bit &quot;1&quot;:
If the interrupt is level mode trigger, the input P0[1] state at level &quot;high&quot; will generate the interrupt.
If the interrupt is edge mode trigger, the input P0[1] state change from &quot;low-to-high&quot; will generate the interrupt.
1 = Enable the P0[1] level-high or low-to-high interrupt
0 = Disable the P0[1] level-high or low-to-high interrupt</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>IR_EN2</name>
              <description>Port 0 Interrupt Enable by Input Rising Edge or Input Level High
IR_EN[2] used to enable the interrupt for each of the corresponding input P0[2]. Set bit &quot;1&quot; also enable the pin wakeup function.
When set the IR_EN[2] bit &quot;1&quot;:
If the interrupt is level mode trigger, the input P0[2] state at level &quot;high&quot; will generate the interrupt.
If the interrupt is edge mode trigger, the input P0[2] state change from &quot;low-to-high&quot; will generate the interrupt.
1 = Enable the P0[2] level-high or low-to-high interrupt
0 = Disable the P0[2] level-high or low-to-high interrupt</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>IR_EN3</name>
              <description>Port 0 Interrupt Enable by Input Rising Edge or Input Level High
IR_EN[3] used to enable the interrupt for each of the corresponding input P0[3]. Set bit &quot;1&quot; also enable the pin wakeup function.
When set the IR_EN[3] bit &quot;1&quot;:
If the interrupt is level mode trigger, the input P0[3] state at level &quot;high&quot; will generate the interrupt.
If the interrupt is edge mode trigger, the input P0[3] state change from &quot;low-to-high&quot; will generate the interrupt.
1 = Enable the P0[3] level-high or low-to-high interrupt
0 = Disable the P0[3] level-high or low-to-high interrupt</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>IR_EN4</name>
              <description>Port 0 Interrupt Enable by Input Rising Edge or Input Level High
IR_EN[4] used to enable the interrupt for each of the corresponding input P0[4]. Set bit &quot;1&quot; also enable the pin wakeup function.
When set the IR_EN[4] bit &quot;1&quot;:
If the interrupt is level mode trigger, the input P0[4] state at level &quot;high&quot; will generate the interrupt.
If the interrupt is edge mode trigger, the input P0[4] state change from &quot;low-to-high&quot; will generate the interrupt.
1 = Enable the P0[4] level-high or low-to-high interrupt
0 = Disable the P0[4] level-high or low-to-high interrupt</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>IR_EN5</name>
              <description>Port 0 Interrupt Enable by Input Rising Edge or Input Level High
IR_EN[5] used to enable the interrupt for each of the corresponding input P0[5]. Set bit &quot;1&quot; also enable the pin wakeup function.
When set the IR_EN[5] bit &quot;1&quot;:
If the interrupt is level mode trigger, the input P0[5] state at level &quot;high&quot; will generate the interrupt.
If the interrupt is edge mode trigger, the input P0[5] state change from &quot;low-to-high&quot; will generate the interrupt.
1 = Enable the P0[5] level-high or low-to-high interrupt
0 = Disable the P0[5] level-high or low-to-high interrupt</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>IR_EN6</name>
              <description>Port 0 Interrupt Enable by Input Rising Edge or Input Level High
IR_EN[6] used to enable the interrupt for each of the corresponding input P0[6]. Set bit &quot;1&quot; also enable the pin wakeup function.
When set the IR_EN[6] bit &quot;1&quot;:
If the interrupt is level mode trigger, the input P0[6] state at level &quot;high&quot; will generate the interrupt.
If the interrupt is edge mode trigger, the input P0[6] state change from &quot;low-to-high&quot; will generate the interrupt.
1 = Enable the P0[6] level-high or low-to-high interrupt
0 = Disable the P0[6] level-high or low-to-high interrupt</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>IR_EN7</name>
              <description>Port 0 Interrupt Enable by Input Rising Edge or Input Level High
IR_EN[7] used to enable the interrupt for each of the corresponding input P0[7]. Set bit &quot;1&quot; also enable the pin wakeup function.
When set the IR_EN[7] bit &quot;1&quot;:
If the interrupt is level mode trigger, the input P0[7] state at level &quot;high&quot; will generate the interrupt.
If the interrupt is edge mode trigger, the input P0[7] state change from &quot;low-to-high&quot; will generate the interrupt.
1 = Enable the P0[7] level-high or low-to-high interrupt
0 = Disable the P0[7] level-high or low-to-high interrupt</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
          </fields>
       </register>
