cmsis-svd/cmsis-svd/data/Nuvoton/M051_Series.xml
       <register>
          <name>ISRC</name>
          <description>Interrupt Trigger Source</description>
          <addressOffset>0x00000020</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>ISRC0</name>
              <description>Port 0 Interrupt Trigger Source Indicator
Read:
1 = Indicates P0[0] generate an interrupt
0 = No interrupt at P0[0]
Write:
1 = Clear the correspond pending interrupt
0 = No action</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>ISRC1</name>
              <description>Port 0 Interrupt Trigger Source Indicator
Read:
1 = Indicates P0[1] generate an interrupt
0 = No interrupt at P0[1]
Write:
1 = Clear the correspond pending interrupt
0 = No action</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>ISRC2</name>
              <description>Port 0 Interrupt Trigger Source Indicator
Read:
1 = Indicates P0[2] generate an interrupt
0 = No interrupt at P0[2]
Write:
1 = Clear the correspond pending interrupt
0 = No action</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>ISRC3</name>
              <description>Port 0 Interrupt Trigger Source Indicator
Read:
1 = Indicates P0[3] generate an interrupt
0 = No interrupt at P0[3]
Write:
1 = Clear the correspond pending interrupt
0 = No action</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>ISRC4</name>
              <description>Port 0 Interrupt Trigger Source Indicator
Read:
1 = Indicates P0[4] generate an interrupt
0 = No interrupt at P0[4]
Write:
1 = Clear the correspond pending interrupt
0 = No action</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>ISRC5</name>
              <description>Port 0 Interrupt Trigger Source Indicator
Read:
1 = Indicates P0[5] generate an interrupt
0 = No interrupt at P0[5]
Write:
1 = Clear the correspond pending interrupt
0 = No action</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>ISRC6</name>
              <description>Port 0 Interrupt Trigger Source Indicator
Read:
1 = Indicates P0[6] generate an interrupt
0 = No interrupt at P0[6]
Write:
1 = Clear the correspond pending interrupt
0 = No action</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>ISRC7</name>
              <description>Port 0 Interrupt Trigger Source Indicator
Read:
1 = Indicates P0[7] generate an interrupt
0 = No interrupt at P0[7]
Write:
1 = Clear the correspond pending interrupt
0 = No action</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
          </fields>
       </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="GP0">
      <name>GP1</name>
      <baseAddress>0x50004040</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GP0">
      <name>GP2</name>
      <baseAddress>0x50004080</baseAddress>
    </peripheral>
