cmsis-svd/cmsis-svd/data/Nuvoton/M051_Series.xml
    <peripheral derivedFrom="GP0">
      <name>GP3</name>
      <baseAddress>0x500040c0</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GP0">
      <name>GP4</name>
      <baseAddress>0x50004100</baseAddress>
    </peripheral>
    <peripheral>
      <name>GPIO</name>
      <description>Registers group</description>
      <groupName>GPIO_GCR</groupName>
      <baseAddress>0x50004180</baseAddress>
      <!-- the first addressBlock is occupied by registers. The second block is reserved -> no access permission -->
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00000004</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
       <register>
          <name>DBNCECON</name>
          <description>Interrupt De-bounce Cycle Control</description>
          <addressOffset>0x00000000</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000020</resetValue>
          <resetMask>0xffffffdf</resetMask>
          <fields>
            <field>
              <name>DBCLKSEL</name>
              <description>De-bounce sampling cycle selection
DBCLKSEL	Description	
0	Sample interrupt input once per 1 clocks	
1	Sample interrupt input once per 2 clocks	
2	Sample interrupt input once per 4 clocks	
3	Sample interrupt input once per 8 clocks	
4	Sample interrupt input once per 16 clocks	
5	Sample interrupt input once per 32 clocks	
6	Sample interrupt input once per 64 clocks	
7	Sample interrupt input once per 128 clocks	
8	Sample interrupt input once per 256 clocks	
9	Sample interrupt input once per 2*256 clocks	
10	Sample interrupt input once per 4*256clocks	
11	Sample interrupt input once per 8*256 clocks	
12	Sample interrupt input once per 16*256 clocks	
13	Sample interrupt input once per 32*256 clocks	
14	Sample interrupt input once per 64*256 clocks	
15	Sample interrupt input once per 128*256 clocks	</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>DBCLKSRC</name>
              <description>De-bounce counter clock source select
1 = De-bounce counter clock source is the internal 10KHz clock
0 = De-bounce counter clock source is the HCLK</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>ICLK_ON</name>
              <description>Interrupt clock On mode
Set this bit &quot;0&quot; will disable the interrupt generate circuit clock, if the pin[n] interrupt is disabled
0 = disable the clock if the P0/1/2/3/4[n] interrupt is disabled
1 = interrupt generated circuit clock always enable 
n=0~7</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
          </fields>
       </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>GP0_BITS</name>
      <description>Registers group</description>
      <groupName>GPIO_BITS</groupName>
      <baseAddress>0x50004200</baseAddress>
      <!-- the first addressBlock is occupied by registers. The second block is reserved -> no access permission -->
      <addressBlock>
        <offset>0x00000200</offset>
        <size>0x00000020</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
       <register>
          <name>Px0_DOUT</name>
          <description>Px.0 Data Output Value</description>
          <addressOffset>0x00000200</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xfffffffe</resetMask>
          <fields>
            <field>
              <name>DOUT</name>
              <description>P0.0 I/O Pin Bit Output Control
Set this bit can control one GPIO pin output value
1 = Set corresponding GPIO bit to high
0 = Set corresponding GPIO bit to low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
          </fields>
       </register>
       <register>
          <name>Px1_DOUT</name>
          <description>Px.1 Data Output Value</description>
          <addressOffset>0x00000204</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xfffffffe</resetMask>
          <fields>
            <field>
              <name>DOUT</name>
              <description>P0.1 I/O Pin Bit Output Control
Set this bit can control one GPIO pin output value
1 = Set corresponding GPIO bit to high
0 = Set corresponding GPIO bit to low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
          </fields>
       </register>
       <register>
          <name>Px2_DOUT</name>
          <description>Px.2 Data Output Value</description>
          <addressOffset>0x00000208</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xfffffffe</resetMask>
          <fields>
            <field>
              <name>DOUT</name>
              <description>P0.2 I/O Pin Bit Output Control
Set this bit can control one GPIO pin output value
1 = Set corresponding GPIO bit to high
0 = Set corresponding GPIO bit to low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
          </fields>
       </register>
       <register>
          <name>Px3_DOUT</name>
          <description>Px.3 Data Output Value</description>
          <addressOffset>0x0000020c</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xfffffffe</resetMask>
          <fields>
            <field>
              <name>DOUT</name>
              <description>P0.3 I/O Pin Bit Output Control
Set this bit can control one GPIO pin output value
1 = Set corresponding GPIO bit to high
0 = Set corresponding GPIO bit to low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
          </fields>
       </register>
       <register>
          <name>Px4_DOUT</name>
          <description>Px.4 Data Output Value</description>
          <addressOffset>0x00000210</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xfffffffe</resetMask>
          <fields>
            <field>
              <name>DOUT</name>
              <description>P0.4 I/O Pin Bit Output Control
Set this bit can control one GPIO pin output value
1 = Set corresponding GPIO bit to high
0 = Set corresponding GPIO bit to low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
          </fields>
       </register>
       <register>
          <name>Px5_DOUT</name>
          <description>Px.5 Data Output Value</description>
          <addressOffset>0x00000214</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xfffffffe</resetMask>
          <fields>
            <field>
              <name>DOUT</name>
              <description>P0.5 I/O Pin Bit Output Control
Set this bit can control one GPIO pin output value
1 = Set corresponding GPIO bit to high
0 = Set corresponding GPIO bit to low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
          </fields>
       </register>
       <register>
          <name>Px6_DOUT</name>
          <description>Px.6 Data Output Value</description>
          <addressOffset>0x00000218</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xfffffffe</resetMask>
          <fields>
            <field>
              <name>DOUT</name>
              <description>P0.6 I/O Pin Bit Output Control
Set this bit can control one GPIO pin output value
1 = Set corresponding GPIO bit to high
0 = Set corresponding GPIO bit to low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
          </fields>
       </register>
       <register>
          <name>Px7_DOUT</name>
          <description>Px.7 Data Output Value</description>
          <addressOffset>0x0000021c</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xfffffffe</resetMask>
          <fields>
            <field>
              <name>DOUT</name>
              <description>P0.7 I/O Pin Bit Output Control
Set this bit can control one GPIO pin output value
1 = Set corresponding GPIO bit to high
0 = Set corresponding GPIO bit to low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
          </fields>
       </register>
